"""
Дан каталог книг. Реализуйте библиотеку для хранения данных книг
и поиску по каталогу. Каталог должен поддерживать возможность добавления
и удаления книг, редактирования информации о книге, а также обладать
персистентностью (т.е. сохранять библиотеку в внешнем файле и подгружать обратно).
Также необходимо оформить точку входа, поддерживать поиск по различным параметрам
и обеспечить интерфейс взаимодействия пользователя с библиотекой.
"""

import functions as f


if __name__ == "__main__":
    f.create_main_window()

